{
  "_name_or_path": "local-pt-checkpoint",
  "architectures": [
    "BertForSequenceClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "classifier_dropout": null,
  "gradient_checkpointing": false,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 768,
  "id2label": {
    "0": "Business_Ethics",
    "1": "Data_Security",
    "2": "Access_And_Affordability",
    "3": "Business_Model_Resilience",
    "4": "Competitive_Behavior",
    "5": "Critical_Incident_Risk_Management",
    "6": "Customer_Welfare",
    "7": "Director_Removal",
    "8": "Employee_Engagement_Inclusion_And_Diversity",
    "9": "Employee_Health_And_Safety",
    "10": "Human_Rights_And_Community_Relations",
    "11": "Labor_Practices",
    "12": "Management_Of_Legal_And_Regulatory_Framework",
    "13": "Physical_Impacts_Of_Climate_Change",
    "14": "Product_Quality_And_Safety",
    "15": "Product_Design_And_Lifecycle_Management",
    "16": "Selling_Practices_And_Product_Labeling",
    "17": "Supply_Chain_Management",
    "18": "Systemic_Risk_Management",
    "19": "Waste_And_Hazardous_Materials_Management",
    "20": "Water_And_Wastewater_Management",
    "21": "Air_Quality",
    "22": "Customer_Privacy",
    "23": "Ecological_Impacts",
    "24": "Energy_Management",
    "25": "GHG_Emissions"
  },
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "label2id": {
    "Access_And_Affordability": 2,
    "Air_Quality": 21,
    "Business_Ethics": 0,
    "Business_Model_Resilience": 3,
    "Competitive_Behavior": 4,
    "Critical_Incident_Risk_Management": 5,
    "Customer_Privacy": 22,
    "Customer_Welfare": 6,
    "Data_Security": 1,
    "Director_Removal": 7,
    "Ecological_Impacts": 23,
    "Employee_Engagement_Inclusion_And_Diversity": 8,
    "Employee_Health_And_Safety": 9,
    "Energy_Management": 24,
    "GHG_Emissions": 25,
    "Human_Rights_And_Community_Relations": 10,
    "Labor_Practices": 11,
    "Management_Of_Legal_And_Regulatory_Framework": 12,
    "Physical_Impacts_Of_Climate_Change": 13,
    "Product_Design_And_Lifecycle_Management": 15,
    "Product_Quality_And_Safety": 14,
    "Selling_Practices_And_Product_Labeling": 16,
    "Supply_Chain_Management": 17,
    "Systemic_Risk_Management": 18,
    "Waste_And_Hazardous_Materials_Management": 19,
    "Water_And_Wastewater_Management": 20
  },
  "layer_norm_eps": 1e-12,
  "max_position_embeddings": 512,
  "model_type": "bert",
  "num_attention_heads": 12,
  "num_hidden_layers": 12,
  "pad_token_id": 0,
  "position_embedding_type": "absolute",
  "transformers_version": "4.28.1",
  "type_vocab_size": 2,
  "use_cache": true,
  "vocab_size": 30522
}
